public class Main {
    /*
    Сотрудники банка выдают кредиты. У каждого есть диапазон по времени - максимальное время и минимальное время которое
    требуется сотруднику для выдачи кредита. ( minTime, maxTime) . Но среди них есть сотрудник/сотрудники, у которых
    вдруг возрастает работоспособность и они начинают выдавать кредиты быстрее, а затем опять скорость может снижатьс до
    обычной.
    Посчитать время, за которое каждый сотрудник выдаст N  кредитов

    1. создать классы:
    -   абстрактный класс AbstractClerk
    -   дочерние классы RegularClerk, LazyInspiredClerk
    2. Должна быть возможность на основе классов создавать потоки. Т.е. родительский класс  должен реализовывать Runnable
     */
}
